# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

brew 'cmatrix'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'brew-php-switcher'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'dbngin'
cask 'docker'
cask 'github'
cask 'microsoft-edge'
cask 'the-unarchiver'
cask 'zoom'
cask 'iterm2'
cask 'wireshark-chmodbpf'
cask 'malwarebytes'
cask 'arduino-ide'
cask 'bitwarden'
cask 'creality-slicer'
cask 'flycut'
cask 'jetbrains-toolbox'
cask 'postman'
cask 'qbittorrent'
cask 'teamviewer'
cask 'sublime-text'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Mac App Store
mas 'Magnet', id: 441258766
mas 'Sequel Ace', id: 1518036000
mas 'Slack', id: 803453959
mas 'Telegram', id: 747648890
